{"Course Title": "Analysis for Management Decisions", "Course Content": "INTRODUCTION\nData is a powerful tool that is available to organizations at a staggering scale. When harnessed correctly, it has the potential to drive decision-making, impact strategy formulation, and improve organizational performance.\nAccording to report by business intelligence company MicroStrategy, 56 percent of respondents said data analytics led to “faster, more effective decision-making” at their companies. Other benefits cited include:\nThis GLOMACS Analysis for Management Decisions training course will highlight:\nGuide to Data & Analytics\nDescriptive Analytics\nDiagnostic Analytics\nPredictive Analytics\nPrescriptive Analytics\nOBJECTIVES\nAt the end of this Analysis for Management Decisions training course, you will learn to:\nIdentify difference between Data Science vs. Data Analytics\nApply Data Analytics In Business\nApply Descriptive Analytics\nApply Diagnostic Analytics\nApply Predictive Analytics\nApply Prescriptive Analytics\nTRAINING METHODOLOGY\nNormal 0 false false false EN-US X-NONE AR-SA MicrosoftInternetExplorer4 /* Style Definitions */ table.MsoNormalTable {mso-style-name:\"Table Normal\"; mso-tstyle-rowband-size:0; mso-tstyle-colband-size:0; mso-style-noshow:yes; mso-style-priority:99; mso-style-parent:\"\"; mso-padding-alt:0cm 5.4pt 0cm 5.4pt; mso-para-margin:0cm; mso-pagination:widow-orphan; font-size:10.0pt; font-family:\"Times New Roman\",serif;} This training course is practical with hands-on training on MS Excel & PowerBI Desktop. 20% of the training course is theory built. 80% uses MS Excel & PowerBI Desktop. Laptops will be made available duration of the training.\nORGANISATIONAL IMPACT\nThe Organisation will have the following benefits;\nImproved efficiency and productivity\nBetter financial performance\nIdentification and creation of new product and service revenue\nImproved customer acquisition and retention\nImproved customer experiences\nCompetitive advantage\nPERSONAL IMPACT\nThe participants will have the following benefits from this Analysis for Management Decisions training course;\nLearn how can you harness the power of data and experience these benefits\nLearn how to analyze data effectively can enable you to draw conclusions, predictions, and actionable insights to drive impactful decision-making\nImprove the skills for professionals in a variety of job roles\nPerform numerical or general data analysis\nShaping and combining data for the purpose of analysis\nWHO SHOULD ATTEND?\nThis GLOMACS Analysis for Management Decisions training course is suitable to a wide range of professionals but will greatly benefit:\nMarketers, who utilize customer data, industry trends, and performance data from past campaigns to plan marketing strategies\nProduct managers, who analyze market, industry, and user data to improve their companies’ products\nFinance professionals, who use historical performance data and industry trends to forecast their companies’ financial trajectories\nHuman resources and diversity, equity, and inclusion professionals, who gain insights into employees’ opinions, motivations, and behaviors and pair it with industry trend data to make meaningful changes within their organizations", "Course Outline": "DAY 1\nA Beginner’s Guide to Data & Analytics\nData science vs. Data analytics\nData science in business\nData analytics in business\nData literacy\nData ecosystem & lifecycle\nData privacy & ethics\nData integrity\nBuilding your data & analytical skill set\n7 data & analytics skills you need\nHow to improve your skills\nThe data-driven decision-making framework\nDAY 2\nDescriptive Analytics\nTraffic and engagement reports\nFinancial statement analysis\nDemand trends\nAggregated survey results\nProgress to goals\nData visualization techniques\nDAY 3\nDiagnostic Analytics\nHypothesis testing\nCorrelation vs. Causation\nDiagnostic regression analysis\nExamining market demand\nExplaining customer behavior\nIdentifying technology issues\nImproving company culture\nDAY 4\nRegression analysis\nSingle linear regression\nMultiple regression\nWhat if analysis\nLogical functions\nData tables\nScenarios\nDAY 5\nPrescriptive Analytics\nVenture capital: Investment decisions\nSales: Lead scoring\nContent curation: Algorithmic recommendations\nBanking: Fraud detection\nProduct management: Development and improvement\nMarketing: Email automation"}
{"Course Title": "Enterprise Leadership for Transformation", "Course Content": "INTRODUCTION\nThis GLOMACS Enterprise Leadership for Transformation training course champions business leaders to develop growth capabilities. The training course facilitates leaders of small and medium enterprises to develop business plans that will grow their business to the next level. As you have built a business you passionately care for, you will want to prepare it for the growth it deserves. However, you may have seen or heard of some businesses that seem to have everything going for them and yet they suddenly run into problems.\nOne of the most common problems for business owners is that they have trouble growing their business. It is not just about managing a cashflow. It is also about putting in place a strategic growth plan to overcome business challenges. This training course will help you define and implement the vision you have for yourself and your business. Working from an initial understanding of your own capabilities, motivators, and resources, it will build a strategic growth plan for moving you and those around you towards a shared perception of the future, able to respond to an ever-changing world. Those participating in this course will have the opportunity to learn from best practices, leverage their strengths, and build on growth ambitions.\nThis Enterprise Leadership for Transformation training course will highlight:\nGrowth Aspiration & Vision\nBuilding Capability for Growth\nInnovation and Technology\nNew Markets\nStrategic Review and Growth Plan\nOBJECTIVES\nAt the end of this Enterprise Leadership for Transformation training course, you will learn to:\nDriving change, especially in the areas of productivity and innovation\nStrengthening and adapting your business strategy for long-term growth\nLearning to identify, assess and develop new market segments\nBoosting talent management strategies to attract, retain and uplift workforce\nIdentifying strategies to go digital as a key asset for future growth\nTRAINING METHODOLOGY\nThis GLOMACS training course is highly interactive and practical. Participants learn through a range of teaching and personal development methods including presentations, tutorials, real life case studies, worked examples, short team exercises and video presentations. Active participation and involvement are encouraged throughout the training course to promote the sharing of ideas and expertise within the group\nORGANISATIONAL IMPACT\nThe Organisation will achieve stronger strategic growth and market development means greater growth potential:\nSee the “big picture” and areas of potential growth\nStrategically think, plan, and implement growth opportunities\nUnderstand critical success factors need for success\nUse their wider market knowledge to make better decisions\nUnderstand how actions and decisions impact key company development\nEffectively communicate ideas to other employees and customers\nPERSONAL IMPACT\nFrom this Enterprise Leadership for Transformation training course, participants will gain the following benefits;\nAchieve successful strategic implementation\nAre mindful of the implications and consequences of different choices\nHave an acute perception of the business issues\nCan make sense out of complexity and make provision for an uncertain future\nAre bold, courageous, and decisive\nAre flexible if further change is warranted in the future\nWHO SHOULD ATTEND?\nThis Enterprise Leadership for Transformation training course is suitable to a wide range of professionals but will greatly benefit:\nBusiness Owners\nSenior personnel\nHuman Resource Managers\nProfessional involved in strategic development\nProduction & Marketing responsibilities", "Course Outline": "DAY 1\nCourage and Leadership\nCourage & self-knowledge\nBehaviour, values and beliefs\nLeadership styles\nLimiting thoughts & behaviours\nBusiness Model explained\nPutting yourself on the line\nDAY 2\nBuilding Capability for Growth\nWho are our customers?\nWhat do they want?\nReview of the marketplace\nHow to leverage data to enrich your business.\nKey business functions like finance and human resources\nReview of your business operations and how to optimise them for greater long-term growth.\nDAY 3\nStrategic Formulation\nVision and mission statements - preparing for the future\nCompetitive positioning vs blue sky approaches\nAchieving competitive advantage through flexibility and agility\nGathering information and intelligence\nStrategic intent, strategic choice and balancing scorecards\nConverting the SWOT analysis into the “strategy matrix”\nStrategy formulation – programmes, projects, policies\nTransforming the organization - strategy implementation and managing change\nDAY 4\nInnovation and Technology\nHow our thinking works in respect of creativity and innovation\nApply the more fluid style to the left and right hemispheres of the brain\nMethods of testing ideas for practicality and relevance\nOvercoming the obstacles to creativity in the mind and in the working environment\nProblem solving and decision making\nDigitalisation and its related technologies that can empower your business\nDAY 5\nStrategic Implementation and Growth Plan\nThe strategy lifecycle and the problem of strategic drift\nGetting innovative thinking into the organization\nThe potentially negative dimensions of success\nHow to avoid 'paralysis by analysis'?\nOvercoming inability to evaluate fresh ideas and denying the truth\nThe critical importance of good planning team dynamics"}
